In [47]:
import numpy as np
import pandas as pd

In [155]:
data_dic = {'A':[1,2,np.nan,4,np.nan],
            'B':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'C':[11,12,13,14,15],
            'D':[16,np.nan,18,19,20]}
df = pd.DataFrame(data_dic) 
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [157]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      float64
 1   B       0 non-null      float64
 2   C       5 non-null      int64
 3   D       4 non-null      float64
dtypes: float64(3), int64(1)
memory usage: 292.0 bytes

In [159]:
#check is there any NULL value
df.isnull()

       A     B      C      D
0  False  True  False  False
1  False  True  False   True
2   True  True  False  False
3  False  True  False  False
4   True  True  False  False

In [161]:
#how many null in each column
df.isnull().sum()

A    2
B    5
C    0
D    1
dtype: int64

In [163]:
#how many null in whole table
#df.isnull().sum().sum()

8

In [165]:
#show the null in 'A' column
df['A'].isnull()

0    False
1    False
2     True
3    False
4     True
Name: A, dtype: bool

In [169]:
#how many null in 'A' column
df['A'].isnull().sum()

2

In [171]:
#same function as isnull
df.isna()

       A     B      C      D
0  False  True  False  False
1  False  True  False   True
2   True  True  False  False
3  False  True  False  False
4   True  True  False  False

In [173]:
df.isna().sum().sum()

8

In [175]:
#kono row te null ase kina
df.loc[1].isnull()

A    False
B     True
C    False
D     True
Name: 1, dtype: bool

In [177]:
#how many null in specific row
df.loc[1].isnull().sum()

2

In [179]:
#check not null ase kina
df.notnull()

       A      B     C      D
0   True  False  True   True
1   True  False  True  False
2  False  False  True   True
3   True  False  True   True
4  False  False  True   True

In [181]:
df.shape

(5, 4)

In [183]:
df.notnull().sum()

A    3
B    0
C    5
D    4
dtype: int64

In [185]:
df.notna().sum()

A    3
B    0
C    5
D    4
dtype: int64

In [187]:
df.notnull().sum().sum()

12

In [189]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [191]:
# column er sum
df['A'].sum()

7.0

In [193]:
df['A'].mean()

2.3333333333333335

In [195]:
#row er sum
df.loc[3].sum()

37.0

In [199]:
#jesob row te null value ase seigula delete
#not permanent
df.dropna(axis=0)

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [201]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [203]:
#jeisob column e null ase seigula delete
#not permanent
df.dropna(axis=1)

    C
0  11
1  12
2  13
3  14
4  15

In [207]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [211]:
#atleast 3ta not-null thakle seisob column bad e baki null jukto column gula delete
df.dropna(thresh=3, axis=1)

     A   C     D
0  1.0  11  16.0
1  2.0  12   NaN
2  NaN  13  18.0
3  4.0  14  19.0
4  NaN  15  20.0

In [213]:
#jeikhane null value thakbe seigula 2 diye fill
df.fillna(value=2)

     A    B   C     D
0  1.0  2.0  11  16.0
1  2.0  2.0  12   2.0
2  2.0  2.0  13  18.0
3  4.0  2.0  14  19.0
4  2.0  2.0  15  20.0

In [215]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [217]:
#'A' column er null value gula seitar mean diye fill up hoye jabe
df['A'].fillna(value = df['A'].mean())

0    1.000000
1    2.000000
2    2.333333
3    4.000000
4    2.333333
Name: A, dtype: float64

In [219]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [225]:
#forward fill- null value ager value diye fill up hoye jabe
#df.fillna(method='ffill') 
df.ffill()

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  16.0
2  2.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  4.0 NaN  15  20.0

In [82]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [83]:
df.fillna(method='bfill')

C:\Users\R ONE\AppData\Local\Temp\ipykernel_1480\2831856154.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  18.0
2  4.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [84]:
df.fillna(0)

     A    B   C     D
0  1.0  0.0  11  16.0
1  2.0  0.0  12   0.0
2  0.0  0.0  13  18.0
3  4.0  0.0  14  19.0
4  0.0  0.0  15  20.0

In [85]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [86]:
from sklearn.impute import SimpleImputer

In [87]:
df2 = df.copy()
df2

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [88]:
imputer = SimpleImputer(strategy='constant', fill_value= -1) 
df2['A'] = imputer.fit_transform(df2[['A']])
df2

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2 -1.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4 -1.0 NaN  15  20.0

In [89]:
df2 = df.copy()
imputer = SimpleImputer(strategy='mean') 
df2['A'] = imputer.fit_transform(df2[['A']])
df2

          A   B   C     D
0  1.000000 NaN  11  16.0
1  2.000000 NaN  12   NaN
2  2.333333 NaN  13  18.0
3  4.000000 NaN  14  19.0
4  2.333333 NaN  15  20.0

In [90]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [91]:
df2 = df.copy()
imputer = SimpleImputer(strategy='median') 
df2['A'] = imputer.fit_transform(df2[['A']])
df2

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  2.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  2.0 NaN  15  20.0

In [92]:
data_dic = {'A':[1,2,np.nan,4,np.nan],
            'B':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'C':[11,12,13,14,15],
            'D':[16,18,np.nan,19,18]}
df2 = pd.DataFrame(data_dic) 
df2

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  18.0
2  NaN NaN  13   NaN
3  4.0 NaN  14  19.0
4  NaN NaN  15  18.0

In [93]:
imputer = SimpleImputer(strategy='most_frequent') 
df2['D'] = imputer.fit_transform(df2[['D']])
df2

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  18.0
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  18.0

In [94]:
from sklearn.impute import KNNImputer

In [95]:
df2 = df.copy()
df2

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [96]:
knn_imputer = KNNImputer(n_neighbors=2, weights="uniform")
A1 = knn_imputer.fit_transform(df2)
A1

array([[ 1., 11., 16.],
       [ 2., 12., 17.],
       [ 3., 13., 18.],
       [ 4., 14., 19.],
       [ 3., 15., 20.]])

In [97]:
df2 = pd.DataFrame(data = A1, columns=['A','C', 'D'])
df2

     A     C     D
0  1.0  11.0  16.0
1  2.0  12.0  17.0
2  3.0  13.0  18.0
3  4.0  14.0  19.0
4  3.0  15.0  20.0

In [98]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [99]:
# fill with you own given value
df.fillna(0, inplace=True)

In [100]:
df

     A    B   C     D
0  1.0  0.0  11  16.0
1  2.0  0.0  12   0.0
2  0.0  0.0  13  18.0
3  4.0  0.0  14  19.0
4  0.0  0.0  15  20.0